#   -*- mode: org; fill-column: 60 -*-

#+TITLE: Dot Emacs  | Deerpig's Dot Emacs
#+AUTHOR: Brad Collins
#+EMAIL: brad@chenla.la
#+STARTUP: showall
#+TOC: headlines 4
#+PROPERTY: header-args    :results drawer  :tangle emacs-dot.el
:PROPERTIES:
:CUSTOM_ID: 
:Name:      /home/deerpig/proj/deerpig/dot-emacs/dot-emacs.org
:Created:   2017-07-02T17:39@Prek Leap (11.642600N-104.919210W)
:ID:        785b0073-5672-4599-9f07-04895472aaab
:VER:       552264039.438531758
:GEO:       48P-491193-1287029-15
:BXID:      pig:ICY6-7517
:Class:     dotemacs
:Type:      literate-program
:Status:    wip
:Licence:   MIT/CC BY-SA 4.0
:END:

[[https://img.shields.io/badge/made%20by-Deerpig-999999.svg?style=flat-square]] 
[[https://img.shields.io/badge/class-dotemacs-0072B2.svg?style=flat-square]]
[[https://img.shields.io/badge/type-literate%20program-0072B2.svg?style=flat-square]]
[[https://img.shields.io/badge/status-wip-D55E00.svg?style=flat-square]]
[[https://img.shields.io/badge/licence-MIT%2FCC%20BY--SA%204.0-000000.svg?style=flat-square]]

* Private & Secrets

Like in customize, we need to keep things like passwords and API keys
out of the main init file which is in a public github repo.

This turned out to be a bit tricky.  The following sources helped, and
clues to getting it to finally word were found on StackExchange.

  - [[https://www.gnu.org/software/emacs/manual/html_node/auth/Help-for-users.html#Help-for-users][Emacs auth-source Library 0.3: Help for users]]
  - [[https://www.masteringemacs.org/article/keeping-secrets-in-emacs-gnupg-auth-sources][Keeping Secrets in Emacs with GnuPG and Auth Sources]] | Mastering Emacs
  - [[http://emacs.stackexchange.com/questions/12660/peculiar-error-triggered-when-calling-erc-org2blog-from-windows-os-x][Peculiar Error triggered when calling ERC, org2blog]]  | Emacs Stack Exchange
  - [[http://emacs.stackexchange.com/questions/10207/how-to-get-org2blog-to-use-authinfo-gpg][org mode - How to get org2blog to use .authinfo.gpg]]  | Emacs Stack Exchange

The next step will be to encrypt .authinfo....


#+begin_src emacs-lisp

(setq auth-source-debug t)

(use-package auth-source
  :config
  (setq
   auth-sources '(
                  ;; default
                  ;; "secrets:session"
                  ;; "secrets:Login"
                  "~/.authinfo"
                  )
   epa-file-cache-passphrase-for-symmetric-encryption t
   ;; need the following to avoid dbus compiling error
   auth-source-debug 'trivia
   ))


#+end_src

#+RESULTS:
:RESULTS:
t
:END:



